

// Пример со строкой: ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

// string[,] table = new string[2, 5]; // Задали двумерный массив, в котором 2 строски м 5 столбцов.
// // String.Empty - инициализация строк
// //table 0.0     table 0.1   table 0.2   table 0.3   table 0.4  //из примера выше - пять столбцов
// //table 1.0     table 1.1   table1.2    table 1.3   table 1.4  //и две строки.


// table[1, 2] = "слово";
// // внешниц цикл, цикл строк по i
// for (int i = 0; i < 2; i++)  // < 2 - колличество строк не больше 2х
// { // Внутрений цикл, цикл столбцов по j
//     for (int j = 0; j < 5; j++) // вложенный цикл < 5 колличетво столбцов.
//     {
//         Console.WriteLine($"-{table[i, j]}- "); // Вывод на печать путём обращения к имени ис аргументами строки и столбцов table[rows, colums] .

//     }
// }
// Ответ :  --
//          --
//          --
//          --
//          --
//          --
//          --
//          -слово-
//          --
//          --

// // Пример с целыми числами: -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

// int[,] matrix = new int[3, 4]; // примкр с числами. 3 строки и 4 столбца.
 
// for (int i = 0; i < 3; i++)  // Вместо цифр i < 3 , принято писать i < matrix.GetLenght(0), где (0) нам почему то даст 3 строки, а
// {
//     for (int j = 0; j < 4; j++)  // принято писать i < matrix.GetLenght(1), где (1) нам почему то даст 4 столбца.
//     {
//         Console.Write($"{matrix[i, j]}  ");
//     }
// Console.WriteLine();
// }

// Пример создания метода, который бутет печать двумерную матрицу на экран и заполнять ее цифрами.-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

int[,] matrix = new int[3, 4];


for (int i = 0; i < matrix.GetLength(0); i++)  // Вместо цифр i < 3 , принято писать i < matrix.GetLenght(0), где (0) нам почему то даст 3 строки, а
{
    for (int j = 0; j < matrix.GetLength(1); j++)  // принято писать i < matrix.GetLenght(1), где (1) нам почему то даст 4 столбца.
    {
        Console.Write($"{matrix[i, j]}  ");
    }
  Console.WriteLine();
}